Repository: pemtat/toyotaapp
Catalog: lib/l10n/app_*.arb
Languages: th

# my_job
source: My Jobs
th: งานของฉัน

# pm_job
source: PM Jobs
th: งาน PM

source: Ticket
th: งานทั้งหมด

source: Calendar
th: ปฏิทิน

source: All Ticket
th: งานทั้งหมด

source: Menu
th: เมนู

source: Name
th: ชื่อ

source: Resource No
th: เลขประจำตัวช่าง

source: Notification
th: การแจ้งเตือน

source: Report
th: รายงาน

source: Account
th: บัญชี

source: Logout
th: ออกจากระบบ

source: Language
th: ภาษา

source: Remark
th: หมายเหตุ

source: Email
th: อีเมล

source: Phone Number
th: หมายเลขโทรศัพท์

source: Job Detail
th: รายละเอียดงาน

source: View Detail
th: ดูรายละเอียด

source: Delete Account
th: ลบบัญชี

source: Version
th: เวอร์ชัน

source: Profile
th: โปรไฟล์

source: History
th: ประวัติ

source: Tech Information
th: ข้อมูลช่างเทคนิค

source: Service Zone
th: โซน

source: View Profile
th: ดูโปรไฟล์

source: Recently Jobs
th: งานใหม่

source: Overdue Jobs
th: งานเกินกำหนด

# total_sparepart
source: Total
th: ราคารวม

source: Total Jobs
th: งานทั้งหมด

source: Field Service Report
th: รายงานการตรวจซ่อม

source: Battery Maintenance Report
th: รายงานการตรวจซ่อมแบตเตอรี่

# pm_report
source: Periodic Maintenance Report
th: รายงานการบำรุงรักษาตามระยะเวลาของรถยกไฟฟ้า

# pm_report_ic
source: Periodic Maintenance Report IC
th: รายงานการบำรุงรักษาตามระยะเวลาของรถยกน้ำมัน

source: Voltage
th: แรงดัน

source: Capacity
th: ความจุ

source: Closed
th: งานเสร็จสิ้น

source: Incoming
th: งานใหม่

source: On Process
th: กำลังดำเนินการ

source: Overdue
th: เกินกำหนด

source: Pending
th: รอดำเนินการ

source: Confirm
th: ยืนยัน

source: Confirmed
th: ยืนยันแล้ว

source: Complete
th: ดำเนินการเสร็จสิ้น

source: Completed
th: เสร็จสมบูรณ์

source: Approved
th: อนุมัติแล้ว

source: Rejected
th: ถูกปฏิเสธ

source: Status
th: สถานะ

source: reset
th: รีเซ็ต

# reset_1
source: Reset
th: รีเซ็ต

source: Date
th: วันที่

source: Today
th: วันนี้

source: Cancel
th: ยกเลิก

source: Yes
th: ใช่

source: No
th: ไม่

source: Loading...
th: กำลังโหลด...

source: Intruction
th: คำแนะนำ

source: Location
th: สถานที่

source: Submit
th: ยืนยัน

source: Accept
th: ยอมรับ

source: Add
th: เพิ่ม

source: Edit
th: แก้ไข

source: Delete
th: ลบ

source: Save
th: บันทึก

# search_filter
source: Search by ID or Title
th: ค้นหาด้วย ID หรือ ชื่อ

source: Before Image
th: ภาพก่อนการเเก้ไข

source: After Image
th: ภาพหลังการเเก้ไข

source: Add Comment
th: เพิ่มความคิดเห็น

source: Upload Image
th: อัปโหลดรูปภาพ

# save_start_time
source: Start Time
th: บันทึกเวลาเริ่มต้น

# save_end_time
source: End Time
th: บันทึกเวลาสิ้นสุด

source: Start Time
th: เวลาเริ่มต้น

source: End Time
th: เวลาสิ้นสุด

source: Sparepart Request Status
th: สถานะคำขออะไหล่

# spare_part_request
source: Spare Part
th: รายการขออนุมัติอะไหล่

# no_jobs
source: No jobs for this day.
th: ไม่มีงานสำหรับวันนี้

# no_jobs_avb
source: No jobs available.
th: ไม่พบงาน

source: Select Date
th: เลือกวันที่

# join_on
source: Joined on
th: เข้าร่วมเมื่อ

source: Step 1
th: ขั้นตอน 1

source: Step 2
th: ขั้นตอน 2

source: Step 3
th: ขั้นตอน 3

source: Step 4
th: ขั้นตอน 4

source: Contact reporter
th: ติดต่อผู้เเจ้งซ่อม

source: Contact Person
th: ผู้ติดต่อ

# intial_checks
source: Initial Checks
th: การตรวจสอบเบื้องต้น

source: Chassis Checks
th: ชุดโครงสร้างรถ

# hydraulic_checks
source: Hydraulic Motor & Pump Checks
th: มอเตอร์ปั๊มและปั๊ม

# steering_checks
source: Steering Motor & Hydraulic Steering System Checks (CBE)
th: มอเตอร์บังคับเลี้ยวและระบบไฮดรอลิคบังคับเลี้ยว

# steering_checks_2
source: Steering Motor & Hydraulic SteeringSystem Checks (CBE)
th: มอเตอร์บังคับเลี้ยวและระบบไฮดรอลิคบังคับเลี้ยว

# drive_checks
source: Drive Motor Checks
th: มอเตอร์ขับ

# brake_checks
source: Brake System Checks
th: เบรก

# controller_checks
source: Controller, Logic box Checks
th: กล่องควบคุมอิเล็กทรอนิกส์

source: Powertrain Checks
th: ชุดส่งกำลัง

# meterial_checks
source: Material Handling Systems Checks
th: ชุดไฮดรอลิค

source: Mast Checks
th: ชุดเสา

source: Motor Checks
th: มอเตอร์

source: Engine Checks
th: เครื่องยนต์

# power_trans_system
source: Power Transmission System Checks
th: ระบบส่งกำลัง

source: Battery Checks
th: แบตเตอรี่

source: Charger Checks
th: ตู้ชาร์จ

# steering_system
source: Steering System Checks
th: ระบบบังคับเลี้ยว

# brake_system
source: Brake System Checks
th: ระบบเบรก

# hydraulic_system
source: Hydraulic System Checks
th: ระบบไฮดรอลิค

# safety_system
source: Safety System Checks
th: ระบบความปลอดภัย

source: Fuel Cell
th: เซลล์เชื้อเพลิง

# vna_om_checks
source: List for VNA & OEM model
th: เฉพาะรถกลุ่ม VNA และ OM

# mhe
source: List for MHE class 3
th: เฉพาะรถกลุ่ม PT/PS เเละ OS

# for_special
source: For Special Equipment
th: อุปกรณ์พิเศษเพิ่มเติม

source: Safety
th: ความปลอดภัย

# pm_sparepart
source: Description Problem / Action and Result / Recommend spare part chaged
th: รายละเอียดปัญหา / การดำเนินการและผลลัพธ์ แนะนำการเปลี่ยนอะไหล่

# pm_sparepart_1
source: Description Problem / Action and Result / Recommend spare part chaged
th: รายละเอียดปัญหา / การดำเนินการและผลลัพธ์ / แนะนำการเปลี่ยนอะไหล่

# bm_sparepart
source: Recommend spare Part
th: รายการอะไหล่ที่ต้องการ

# maintenance_service
source: Maintenance and Service Result
th: ผลการตรวจเช็คเเละการบำรุงรักษา

source: Division
th: แผนก

# go_to_machine
source: Go to the machine
th: ไปที่พาหนะ

# report_to_admin
source: Report to admin about machine
th: เเจ้งรายละเอียดรถให้เเอดมิน

source: Complete Investigation
th: บันทึกการตรวจสอบ

source: Reported by
th: เเจ้งซ่อมโดย

# delete_account_message
source: Your account will be deleted within 30 days. Are you sure to delete account?
th: บัญชีของคุณจะถูกลบภายใน 30 วัน คุณแน่ใจหรือไม่ว่าต้องการลบบัญชี?

# logout_message
source: Are you sure to logout?
th: คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบ?

# logout_confirm
source: Yes, Logout
th: ใช่, ออกจากระบบ

# confirm_message
source: Are you sure to confirm?
th: ยืนยันการบันทึก?

# accept_job
source: Do you confirm to accept this job?
th: คุณยืนยันที่จะรับงาน?

# fill_request
source: Please fill the
th: กรุณากรอก

source: Require Field
th: จำเป็นต้องกรอก

source: Customer Name
th: ชื่อลูกค้า

source: Department
th: แผนก

source: Contact Name
th: ชื่อผู้ติดต่อ

source: Contacted Name
th: ชื่อผู้ติดต่อ

source: Operation Hour
th: ชั่วโมงการทำงานของรถ

source: Mast Type
th: ประเภทเสา

source: Lift Height
th: ความสูง

source: Customer Fleet No.
th: เบอร์รถ

source: Fault
th: อาการเเจ้งซ่อม

source: Order No.
th: หมายเลขงาน

source: Broken
th: แตกหัก

source: Lack of grease
th: ไม่มีจาระบี

source: Lack of oil
th: ไม่มีน้ำมัน

source: Incorrect Assembly
th: ประกอบผิด

source: Dirty
th: สกปรก

source: Worn out
th: สึกหรอ

source: Short circuit
th: ลัดวงจร

source: Corroded
th: ผุกร่อน

source: Vibration
th: สั่น

source: Mechanically Locked
th: ติดขัด

source: Leakage
th: รั่ว

source: Loose
th: หลวม

source: Abnormal noise
th: เสียงดังผิดปกติ

source: Missing part
th: ใส่อุปกรณ์ผิด

source: Overheated
th: ความร้อนเกิน

source: Other
th: อื่นๆ

# cm
source: CM Repair works when the repair is first reported
th: CM งานตรวจซ่อมเมื่อมีการเเจ้งซ่อมในครั้งแรก

# cmc
source: CMC Repair/Part replacement work
th: CMC งานซ่อมแซม/เปลี่ยนอะไหล่

# wa
source: WA Inspection repair work that is in the conditions
th: WA งานตรวจ/ซ่อมแซม ที่อยู่ในเงื่อนไข

# ac
source: AC Repair work result from an accident
th: AC งานตรวจซ่อม ที่สืบเนื่องจากอุบัติเหตุ

# ff
source: FF In-depth problem analysis work
th: FF งานวิเคราห์ปัญหาเชิงลึก

# sot
source: SOT Helps other people or other team
th: SOT ช่วยงานคนอื่นหรือทีมอื่น

# mo
source: MO Modification work, editing
th: MO งานดัดแปลง, เเก้ไข

# sb
source: SB Waiting/Standby
th: SB รองาน/สแตนต์บาย

# co
source: CO Assembly/Installation work, dismantling
th: CO งานประกอบ/ติดตั้ง, รื้อถอด, นำกลับ

source: Repair Prodecure
th: ขั้นตอนการซ่อม

# cause_problem
source: Cause of the problem
th: สาเหตุของปัญหา

source: Request
th: ขออนุมัติ

# request_message
source: Are you sure to request?
th: คุณยืนยันที่จะขออนุมัติ?

source: Spare Part
th: ขออนุมัติอะไหล่

# recommended_spare_part_list
source: Recommended Spare Part
th: รายการอะไหล่แนะนำ

source: Spare Part List
th: รายการอะไหล่

source: Additional Spare Part List
th: รายการอะไหล่เพิ่มเติม

# additional_description_spare_part
source: Additional Description
th: รายละเอียดอะไหล่เพิ่มเติม

# description_spare_part
source: Description
th: รายละเอียดอะไหล่

source: Change Now
th: เปลี่ยนตอนนี้

source: Change on PM
th: เปลี่ยนตอน PM

source: Quantity
th: จำนวน

source: Repair Result
th: ผลการตรวจซ่อม

source: Process Staff
th: สำหรับเจ้าหน้าที่

source: Inspector
th: ผู้ตรวจซ่อม

source: Inspector 1
th: ผู้ตรวจซ่อม 1

source: Inspector 2
th: ผู้ตรวจซ่อม 2

source: Battery Information
th: ข้อมูลแบตเตอรี่

source: Battery Band
th: ยี่ห้อแบตเตอรี่

source: Battery Model
th: รุ่นแบตเตอรี่

# battery_serial
source: Serial No.
th: หมายเลขแบตเตอรี่

source: Battery Lifespan
th: อายุแบตเตอรี่

source: Shift time
th: การใช้งาน

source: Hrs. per shift
th: ชั่วโมงใช้งานต่อกะ

source: Ratio
th: อัตรารถยกต่อแบตฯ

source: Manufacturer No.
th: รหัสแบตเตอรี่

source: Forklift Information
th: ข้อมูลทั่วไปของรถยกไฟฟ้า

source: Forklift Brand
th: รุ่นรถยกไฟฟ้า

source: Forklift Model
th: ยี่ห้อรถยกไฟฟ้า

# forklift_serial_no
source: Serial No
th: หมายเลขรถยกไฟฟ้า

source: Forklift Operation
th: ชั่วโมงรถยกไฟฟ้า

source: Battery Usage
th: ข้อมูลการใช้งานแบตเตอรี่

source: Charging Type
th: ลักษณะการชาร์จ

# summary_issue
source: Summary of issue
th: หัวข้อปัญหา

source: More details
th: รานละเอียดเพิ่มเติม

source: Less details
th: ย่อ

# machine_details
source: Machine Detail
th: ข้อมูลรถ

source: Model
th: โมเดลรถ

source: Serial Number
th: ซีเรียลรถ

source: Customer Information
th: ข้อมูลลูกค้า

# specic_gravity
source: Specic Gravity and Voltage Check
th: การตรวจวัดค่า ก.พ. เเละค่าแรงดันของแบตเตอรี่

source: Temperature
th: อุณหภูมิ

source: Sp.Gr
th: ก.พ.

source: Corrective Action
th: แนวทางการตรวจซ่อมแบตเตอรี่

# repair_pm_battery
source: Repair and P.M Battery
th: สรุปผลการตรวจซ่อมเเละบำรุงรักษาแบตเตอรี่

source: Save Signature
th: บันทึกลายเซ็นต์

source: Sign
th: เซ็นชื่อ

source: View PDF
th: ดู PDF

# language_message
source: Are you confirm to change?
th: คุณยืนยันหรือไม่ที่จะเปลี่ยน?

source: View Part Detail
th: ดูรายละเอียดอะไหล่

# fill_more_4
source: Please enter 4 or more characters to search
th: โปรดกรอก 4 ตัวอักษรขึ้นไปเพื่อค้นหา

source: Add Remark
th: เพิ่มหมายเหตุ

source: Spare Part Remark
th: หมายเหตุอะไหล่

source: Additional Spare Part Remark
th: หมายเหตุอะไหล่เพิ่มเติม

# save_message
source: Are you confirm to save report?
th: คุณยืนยืนที่จะบันทึกฟอร์ม?

source: Clear
th: ล้าง

# signature_require_1
source: Please sign before saving the data.
th: โปรดลงชื่อก่อนบันทึกข้อมูล

# signature_require_2
source: Please add a signature before saving the data.
th: โปรดเพิ่มลายเซ็นก่อนบันทึกข้อมูล

# complete_message
source: Are you sure to complete?
th: คุณยืนยันที่จะดำเนินการต่อ?

source: No jobs history
th: ไม่มีประวัติงาน

# no_new_jobs
source: No new jobs available.
th: ไม่มีงานใหม่

source: Battery Condition
th: สภาพโดยรวมของแบตเตอรี่

source: Description
th: รายละเอียด

source: Cell Battery
th: เซลล์แบตเตอรี่

source: Total Voltage
th: แรงดันรวม

source: Working Period
th: ระยะเวลาการทำงาน

source: Save Change.
th: บันทึกการเปลี่ยนแปลง

source: Copy Text.
th: คัดลอกข้อความ

source: Warning
th: เเจ้งเตือน

# warning_message_1
source: Please fill out at least 1 item
th: โปรดกรอกข้อมูลอย่างน้อย 1 รายการ

# warning_message_2
source: Please fill in all required information.
th: โปรดกรอกข้อมูลที่จำเป็นให้ครบถ้วน

# warning_update
source: The app has a new version update. Please update the app to continue using it.
th: เวอร์ชั่นแอพมีการอัพเดทใหม่ กรุณาอัปเดตแอพเพื่อใช้งาน

# warning_file
source: This file format is not supported. Please select a file with the extension .jpg, .jpeg, or .png.
th: ระบบไม่รองรับไฟล์นามสกุลนี้ โปรดเลือกไฟล์นามสกุล .jpg .jpeg .png

# warning_yes
source: Close
th: ตกลง

source: Service Type
th: ประเภทงานบริการ

# chassis_no
source: Chassis Number
th: หมายเลขตัวถัง

# safety_maintenance
source: Safety Equipment Compliance
th: ความสมบูรณ์ของอุปกรณ์ Safety ตามกฎกระทรวง

source: Saving data...
th: กำลังบันทึกข้อมูล...

# save_successful
source: Data saved successfully.
th: บันทึกข้อมูลสำเร็จ

# signature_save
source: Signature saved successfully
th: บันทึกลายเซ็นสำเร็จ

source: Copy APK link
th: คัดลอกลิ้ง APK

source: Enter
th: ใส่

source: Option
th: ตัวเลือก

source: Item
th: รายการ

source: Close
th: ปิด

source: Approve
th: อนุมัติ

source: Not Approve
th: ไม่อนุมัติ

source: Quotation
th: เสนอราคา

source: Select Tech
th: เลือกช่าง

source: Search Name
th: ค้นหาชื่อ

# customer_checking
source: TOYOTA employees have cleaned the workplace area.
th: พนักงาน TOYOTA ได้ทำความสะอาดพื้นที่ที่ทำงาน

# customer_score
source: Please rate your satisfaction with the service.
th: โปรดให้คะแนนความพึงพอใจในการรับบริการ

# customer_description
source: Suggestions for improving the service.
th: ข้อเสนอแนะเพื่อปรับปรุงการบริการ

source: Very Satisfied
th: มากที่สุด

source: Satisfied
th: มาก

source: Neutral
th: พอใช้

source: Dissatisfied
th: น้อย

source: Need Improvement
th: ควรปรับปรุง

# checking_done
source: Neat
th: เรียบร้อย

# checking_not_done
source: Messy
th: ไม่เรียบร้อย

# no_spare_part
source: No spare parts found
th: ไม่พบรายการอะไหล่

source: Estimate Report
th: ใบประเมินราคา

# warning_require_sparepart
source: Please select a spare parts list to continue.
th: โปรดเลือกรายการอะไหล่เพื่อดำเนินการต่อ

source: Return Spare Part
th: รายการขออนุมัติคืนอะไหล่

source: Return Spare Part Status
th: สถานะการขออนุมัติคืนอะไหล่

# return_spare_part_action
source: Return Spare Part
th: คืนรายการอะไหล่

source: Edit Part
th: เเก้ไขอะไหล่
